[
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Normal and/or any skin type",
        "skin_type": "",
        "ingredients": "Lotion",
        "product_type": "",
        "description": "Lotions are more moisturizing than a gel, and absorb well without being too heavy. It is ideal for all skin types.",
        "product_cheap": "CeraVe Daily Moisturizing Lotion - $16",
        "product_expensive": "Osmia Purely Simple Face Cream - $62"
    },
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Oily and/or acne-prone",
        "skin_type": "",
        "ingredients": "Gel moisturizer",
        "product_type": "",
        "description": "A gel-like mostly water-based option that's lightweight and absorbs quickly works best for oily/acne-prone skin.",
        "product_cheap": "Cetaphil Soothing Gel Cream - $14",
        "product_expensive": "Skinfix Barrier + Skin Barrier Niacinamide Restoring Gel Cream - $48"
    },
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Dry, red and/or eczema-prone",
        "skin_type": "",
        "ingredients": "Cream and soft cream",
        "product_type": "",
        "description": "A more oil-based and thicker cream works wonders for dry and/or eczema-prone skin.",
        "product_cheap": "e.l.f. Holy Hydration! Face Cream - $11",
        "product_expensive": "Skinfix Barrier + Triple Lipid-Peptide Face Cream - $78"
    },
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Combination",
        "skin_type": "",
        "ingredients": "Soft cream",
        "product_type": "",
        "description": "Users with combination skin should seek a mix of hydrating ingredients, like hyaluronic acid, glycerin, and ones that will minimize shine and oil production.",
        "product_cheap": "Neutrogena Hydro Boost Hydrating Water Gel Moisturizer - $10",
        "product_expensive": "COSRX Advanced Snail 92 All in one cream - $28"
    },
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Inflamed and/or sensitive",
        "skin_type": "",
        "ingredients": "Moisturizing balm",
        "product_type": "",
        "description": "Much like a cream, a balm works great for extremely dry skin types that can be inflamed/sensitive.",
        "product_cheap": "Aveeno Calm + Restore Skin Therapy Balm - $20",
        "product_expensive": "REN Clean Skincare Evercalm Overnight Recovery Balm - $55"
    },
    {
        "category": "Moisturizer",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Mature",
        "skin_type": "",
        "ingredients": "Gel moisturizer",
        "product_type": "",
        "description": "Users with mature skin should seek moisturizers that hydrate and nourish your skin with organic extracts as well as vitamins and collagen to help reduce fine lines and wrinkles.",
        "product_cheap": "CeraVe Skin Renewing Night Cream - $22",
        "product_expensive": "Anti-Aging Clear Skin Hydrator - $38"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Normal and/or any skin type",
        "skin_type": "",
        "ingredients": "Micellar water",
        "product_type": "",
        "description": "A staple of French routines, this soap-free option contains molecules that attract debris and oil like a magnet without causing any dryness. It's suitable for almost every skin type and unlike most other cleansers, there's no need to rinse it off or rub it in -- a simple swipe will do.",
        "product_cheap": "Garnier SkinActive Micellar Water for All Skin Types - $8",
        "product_expensive": "The Outset Gentle Micellar Antioxidant Cleanser - $32"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Oily and/or acne-prone",
        "skin_type": "",
        "ingredients": "Foaming liquid",
        "product_type": "",
        "description": "When activated with water or pumped into your palm, this cleanser morphs into an airy foam that helps break down dirt and excess sebum from pores, which is beneficial to those with oily and/or acne-prone skin types.",
        "product_cheap": "Cetaphil Gentle Foaming Facial Cleanser - $9",
        "product_expensive": "Moon Juice Milk Cleanse Gentle Foaming Cleanser - $32"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Dry, red and/or eczema-prone",
        "skin_type": "",
        "ingredients": "Cream/ lotion",
        "product_type": "",
        "description": "Formulated with emollients such as glycerin or shea butter, a cream/lotion will wipe away impurities while also hydrating skin.",
        "product_cheap": "Acure Seriously Soothing Cleansing Cream - $12",
        "product_expensive": "Tatcha The Rice Wash Skin-Softening Cleanser - $40"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Combination",
        "skin_type": "",
        "ingredients": "Micellar water",
        "product_type": "",
        "description": "A staple of French routines, this soap-free option contains molecules that attract debris and oil like a magnet without causing any dryness. It's suitable for almost every skin type and unlike most other cleansers, there's no need to rinse it off or rub it in -- a simple swipe will do.",
        "product_cheap": "Garnier SkinActive Micellar Water for All Skin Types - $8",
        "product_expensive": "The Outset Gentle Micellar Antioxidant Cleanser - $32"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Inflamed and/or sensitive",
        "skin_type": "",
        "ingredients": "Oil",
        "product_type": "",
        "description": "While putting oil on your face might not feel cleansing, it actually is (just think, oil absorbs oil)! One like argan is non-comedogenic, lightweight, moisturizing, and well-tolerated, making it ideal for those with sensitive skin types.",
        "product_cheap": "Neutrogena Ultra Light Cleansing Oil - $9",
        "product_expensive": "Skinfix Barrier + Foaming Oil Hydrating Cleanser - $30"
    },
    {
        "category": "Cleanser",
        "lip_concerns": "",
        "spf_ingredients": "",
        "skin_concerns": "Mature",
        "skin_type": "",
        "ingredients": "Melting balm",
        "product_type": "",
        "description": "This butter-like salve transforms or melts into a liquid when rubbed onto your skin. It can be used without water to dissolve heavy makeup and tends to be very soothing.",
        "product_cheap": "CeraVe Cleansing Balm - $10",
        "product_expensive": "Paula's Choice Omega + Complex Cleansing Balm - $29"
    },
    {
        "category": "Eye Cream",
        "lip_concerns": "Under eye bags/ inflammation",
        "spf_ingredients": "Caffeine, Peptides, Hyaluronic acid",
        "skin_concerns": "Cream",
        "skin_type": "Under eye bags are best treated with caffeine, peptides, and hyaluronic acid. These ingredients instantly reduce puffiness, and inflammation/under-eye bags.",
        "ingredients": "The Inkey List caffeine eye cream - $10.99",
        "product_type": "Paula's Choice C5 Super Boost Eye Cream -  $39",
        "description": ""
    },
    {
        "category": "Eye Cream",
        "lip_concerns": "Under eye discoloration/ visible veins",
        "spf_ingredients": "Vitamin C, Kojic Acid, Niacinamide",
        "skin_concerns": "Gel cream or cream",
        "skin_type": "Users with under eye discoloration or visible veins should look for products including vitamin C, kojic acid and niaminicide because they visibly brighten dark circles and rejuvenate tired, puffy eyes.",
        "ingredients": "CeraVe Eye Repair Cream - $19.99",
        "product_type": "Glow Recipe Guava Vitamin C Bright Eye-Gel Cream - $38",
        "description": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Normal and/or any skin type",
        "spf_ingredients": "Micellar",
        "skin_concerns": "Micellar water makeup removers are well-suited for all skin types because they offer a gentle and versatile cleansing solution. The micelles in the formula are tiny oil molecules that attract and lift away dirt, makeup, and impurities without the need for harsh scrubbing. They provide effective makeup removal while being mild and non-irritating, making them suitable for sensitive skin. Micellar water is also typically hydrating and doesn't leave a residue, so it works for dry, oily, and combination skin types, maintaining a balanced and refreshed feel after use. It's a versatile option that caters to various skin needs.",
        "skin_type": "Garnier SkinActive Micellar Cleansing Water All-in-1 Brightening with Vitamin C - $8",
        "ingredients": "Klorane Micellar Water with Organically Farmed Cornflower - $26",
        "product_type": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Oily and/or acne prone",
        "spf_ingredients": "Oil-free",
        "skin_concerns": "Oil-free makeup removers are ideal for oily skin types because they help maintain a matte and non-greasy complexion. Oily skin produces excess sebum, and using an oil-based remover may exacerbate this issue. Oil-free makeup removers effectively dissolve makeup, dirt, and impurities without adding more oil to the skin. They leave the skin feeling clean and refreshed without clogging pores or contributing to breakouts, making them a suitable choice for individuals with oily skin.",
        "skin_type": "Micellar Cleansing Water All-in-1 Mattifying - $11",
        "ingredients": "Mary Kay Oil-Free Eye Makeup Remover - $20",
        "product_type": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Dry, red and/or eczema prone",
        "spf_ingredients": "Creamy",
        "skin_concerns": "Creamy makeup removers are well-suited for dry skin types because they are typically hydrating and moisturizing. Their creamy texture helps to dissolve makeup and impurities without stripping the skin of its natural oils. This type of remover often contains nourishing ingredients that can replenish moisture, leaving the skin feeling soft and hydrated, which is particularly beneficial for dry skin that lacks natural hydration. Additionally, creamy makeup removers are less likely to cause further dryness or irritation, making them a gentle choice for individuals with dry skin.",
        "skin_type": "e.l.f Holy Hydration! Makeup Melting Cleansing Balm - $11",
        "ingredients": "Clinique Take the Day Off Cleansing Balm Makeup Remover - $38",
        "product_type": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Combination",
        "spf_ingredients": "Oil-based + foaming cleanser",
        "skin_concerns": "Using an oil-based makeup remover followed by a foaming cleanser is an excellent choice for combination skin because it addresses the different needs of oily and dry areas. The oil-based remover effectively breaks down and removes makeup, impurities, and excess sebum from the oily zones without over-drying them. The foaming cleanser, on the other hand, can thoroughly cleanse and refresh the drier areas without stripping them of essential moisture. This two-step process helps maintain a balanced, clean, and well-hydrated complexion, making it ideal for combination skin types with varying needs.",
        "skin_type": "e.l.f Holy Hydration! Makeup Melting Cleansing Balm - $11",
        "ingredients": "Curél Makeup Cleansing Oil - $14",
        "product_type": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Inflamed and/or sensitive",
        "spf_ingredients": "Hypoallergenic", "skin_concerns": "Hypoallergenic makeup removers are the safest choice for individuals with inflamed or sensitive skin because they are formulated to minimize the risk of irritation and allergies. These removers are made with ingredients that are less likely to trigger adverse reactions in the skin, helping to reduce redness, burning, or itching. Hypoallergenic makeup removers are typically fragrance-free, alcohol-free, and free of common irritants, making them a gentle option for those with sensitivities or inflammatory skin conditions.",
        "skin_type": "Neutrogena Gentle Eye Makeup Remover - $8",
        "ingredients": "Almay Longwear & Waterproof Eye Makeup Remover Pads - $7",
        "product_type": ""
    },
    {
        "category": "Makeup Remover",
        "lip_concerns": "Mature",
        "spf_ingredients": "Anti-aging",
        "skin_concerns": "Makeup removers with anti-aging properties are ideal for mature skin because they offer additional benefits beyond makeup removal. These removers often contain ingredients that help address common aging concerns, such as fine lines, wrinkles, and loss of firmness. As a result, they can enhance the overall condition and appearance of the skin while effectively removing makeup and impurities. Makeup removers with anti-aging benefits provide a convenient way for individuals with mature skin to maintain a youthful and radiant complexion while completing their makeup removal routine.",
        "skin_type": "Neutrogena Oil-Free Eye Makeup Remover - $6",
        "ingredients": "Garnier SkinActive Micellar Cleansing Water All-in-1 Waterproof - $7",
        "product_type": ""
    },
    {
        "category": "Sunscreen",
        "lip_concerns": "Broad-spectrum protection",
        "spf_ingredients": "Zinc oxide, Titanium dioxide",
        "skin_concerns": "Sunscreen",
        "skin_type": "Users looking for broad-spectrum protection should opt for sunscreens that contain physical blockers like zinc oxide and titanium dioxide. These minerals create a protective barrier on the skin's surface, reflecting and scattering harmful UV rays. They are less likely to cause irritation or allergies, making them suitable for sensitive skin. Additionally, physical blockers offer immediate protection upon application, making them a reliable choice for outdoor activities or prolonged sun exposure.",
        "ingredients": "EltaMD UV Clear Broad-Spectrum SPF 46 - $37",
        "product_type": "Coppertone Pure & Simple Sunscreen Lotion SPF 50 - $9"
    },
    {
        "category": "Sunscreen",
        "lip_concerns": "Water-resistant",
        "spf_ingredients": "Sport",
        "skin_concerns": "Water-resistant and sport sunscreens are ideal for individuals who engage in water activities, sports, or outdoor workouts. These sunscreens are formulated to withstand water and sweat, providing long-lasting protection during intense physical activities. They create a durable barrier on the skin's surface, preventing UV rays from penetrating. Water-resistant and sport sunscreens are suitable for all skin types and offer reliable sun protection while maintaining their effectiveness even in challenging conditions.",
        "skin_type": "Banana Boat Sport Performance Sunscreen Lotion SPF 50 - $6",
        "ingredients": "Neutrogena Ultra Sheer Dry-Touch Sunscreen SPF 100 - $8",
        "product_type": ""
    },
    {
        "category": "Sunscreen",
        "lip_concerns": "Oil-free",
        "spf_ingredients": "Non-comedogenic", "skin_concerns": "Oil-free and non-comedogenic sunscreens are the best choice for individuals with oily or acne-prone skin. These sunscreens are formulated to provide protection without clogging pores or causing breakouts. They are lightweight and easily absorbed, helping to maintain a matte finish and prevent excess oil production. Oil-free and non-comedogenic sunscreens are ideal for daily use and can be comfortably applied under makeup, ensuring that the skin remains protected while looking fresh.",
        "skin_type": "La Roche-Posay Anthelios Melt-in Milk Sunscreen SPF 60 - $36",
        "ingredients": "Neutrogena Hydro Boost Water Gel Lotion SPF 30 - $9",
        "product_type": ""
    },
    {
        "category": "Sunscreen",
        "lip_concerns": "Hydrating", "spf_ingredients": "Sunscreen with hydrating properties are suitable for individuals with dry or dehydrated skin. These sunscreens often contain moisturizing ingredients such as hyaluronic acid, glycerin, or ceramides to help replenish and retain moisture in the skin. In addition to providing sun protection, hydrating sunscreens leave the skin feeling soft, smooth, and comfortable, addressing dryness and preventing further moisture loss. They are especially beneficial for individuals with skin that tends to feel tight, flaky, or rough.",
        "skin_concerns": "Aveeno Protect + Hydrate Face Moisturizing Sunscreen SPF 50 - $8",
        "skin_type": "EltaMD UV Elements Tinted Broad-Spectrum SPF 44 - $36",
        "ingredients": ""
    },
    {
        "category": "Sunscreen",
        "lip_concerns": "Mineral",
        "spf_ingredients": "Mineral sunscreens are the safest choice for individuals with sensitive or reactive skin. These sunscreens contain physical blockers such as zinc oxide and titanium dioxide, which create a protective barrier on the skin's surface to reflect and scatter UV rays. Mineral sunscreens are less likely to cause irritation, allergies, or burning sensations, making them gentle and soothing for sensitive skin. They offer broad-spectrum protection and are suitable for daily use, providing reliable sun protection without the risk of adverse reactions.",
        "skin_concerns": "Mineral sunscreens offer reliable sun protection with the use of zinc oxide and titanium dioxide as active ingredients. These minerals create a physical barrier on the skin's surface, reflecting and scattering harmful UV rays. Mineral sunscreens are the safest choice for individuals with sensitive or reactive skin. They are less likely to cause irritation, allergies, or burning sensations, making them gentle and soothing for sensitive skin. Additionally, mineral sunscreens are effective immediately upon application, providing instant protection against UV radiation. They are suitable for all skin types and ages.",
        "skin_type": "CeraVe Hydrating Mineral Sunscreen SPF 30 - $10",
        "ingredients": "EltaMD UV Clear Tinted Broad-Spectrum SPF 46 - $39",
        "product_type": ""
    },
    {
        "category": "Lip Moisturizer",
        "lip_concerns": "Flaky or chapped lips",
        "spf_ingredients": "Lip balm with SPF",
        "skin_concerns": "Lip balms with SPF are essential for protecting your lips from sun damage. Prolonged sun exposure can lead to dry, chapped, and burnt lips, so it's crucial to keep them shielded. Look for lip balms that contain SPF to guard against UV radiation. These lip balms provide sun protection, hydration, and nourishment to keep your lips soft, smooth, and healthy.",
        "skin_type": "Aquaphor Lip Repair Ointment - $3",
        "ingredients": "Fresh Sugar Lip Treatment SPF 15 - $24",
        "product_type": ""
    },
    {
        "category": "Lip Moisturizer",
        "lip_concerns": "Sensitive lips",
        "spf_ingredients": "Hypoallergenic lip balms",
        "skin_concerns": "Hypoallergenic lip balms are suitable for individuals with sensitive lips. These lip balms are crafted with ingredients that are less likely to cause irritation or allergies, reducing the risk of redness, burning, or itching. Hypoallergenic lip balms are typically fragrance-free and free of common irritants, making them a gentle option for those with sensitivities.",
        "skin_type": "Neutrogena Norwegian Formula Lip Moisturizer SPF 15 - $2",
        "ingredients": "Burt's Bees 100% Natural All-Weather SPF 15 Moisturizing Lip Balm - $3.59",
        "product_type": ""
    },
    {
        "category": "Lip Moisturizer",
        "lip_concerns": "Anti-aging",
        "spf_ingredients": "Anti-aging lip treatments",
        "skin_concerns": "Lip moisturizers with anti-aging properties are ideal for addressing fine lines and wrinkles around the lips. These treatments often contain ingredients like retinol and peptides to improve the overall appearance of your lips while providing essential hydration. Anti-aging lip moisturizers are a convenient way to maintain a youthful and rejuvenated look for your lips.",
        "skin_type": "Neutrogena Rapid Wrinkle Repair Regenerating Cream - $21.49",
        "ingredients": "L'Oréal Paris Revitalift Anti-Wrinkle + Firming Face & Neck Anti-Aging Cream - $10.95",
        "product_type": ""
    } 
]
